Repository: quarkusio/cn.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en
Languages: zh_cn

source: Start Redis automatically in dev and test modes.
zh_cn: 在开发和测试模式下自动启动Redis。

source: Start by adding the following dependencies to your test project:
zh_cn: 首先在你的测试项目中添加以下依赖项：

source: Start the OpenTelemetry Collector and Jaeger system via the following `docker-compose.yml` file that you can launch via `docker-compose up -d`:
zh_cn: 您可以通过 `docker-compose up -d` 命令和下面的 `docker-compose.yml` 文件来启动OpenTelemetry Collector和Jaeger系统：

source: Start with adding the following dependency:
zh_cn: 首先要添加以下依赖关系：

source: Start your application in dev mode:
zh_cn: 在开发模式下启动您的应用程序：

source: Starting and Configuring the Keycloak Server
zh_cn: 启动和配置Keycloak服务器

source: Starting and stopping transactions: defining your boundaries
zh_cn: 开始和停止事务：确定你的事务边界

source: Starting services before the Quarkus application starts
zh_cn: 在Quarkus应用程序启动之前启动服务

source: Starting the Redis server
zh_cn: 启动Redis服务

source: Starting with Oracle GraalVM 20.2 or Mandrel 20.1, debug symbols for native executables can be generated for Linux environments (Windows support is still under development, macOS is not supported). These symbols can be used to debug native executables with tools such as `gdb`.
zh_cn: 从Oracle GraalVM 20.2或Mandrel 20.1开始，可以为Linux环境生成原生可执行文件的调试符号（Windows支持仍在开发中，不支持macOS）。这些符号可用于用工具调试原生可执行文件，如 `gdb` 。

source: Status
zh_cn: 状态

source: Step <span class="step-no">1</span>
zh_cn: 步骤<span class="step-no">1</span>

source: Step <span class="step-no">2</span>
zh_cn: 步骤<span class="step-no">2</span>

source: Step <span class="step-no">3</span>
zh_cn: 步骤<span class="step-no">3</span>

source: Step <span class="step-no">4</span>
zh_cn: 步骤<span class="step-no">4</span>

source: Store the managed Vert.x instance into a field.
zh_cn: 将被管理的Vert.x实例存储到一个字段当中。

source: Streaming Kafka topics as server-sent events
zh_cn: 将Kafka topic作为服务器发送的事件流化

source: Streaming a Kafka topic as server-sent events (SSE) is straightforward:
zh_cn: 将Kafka topic作为服务器发送的事件(Server-sent events, SSE)进行流化非常直白:

source: Streamlined code for the 80% common usages, flexible for the 20%
zh_cn: 简化80%的常用代码，灵活处理剩余的20%

source: Strimzi provides container images and Operators for running Apache Kafka on Kubernetes. While Strimzi is optimized for Kubernetes, the images work perfectly in classic container environments. Strimzi container images run "genuine" Kafka broker on JVM, which is slower to start.
zh_cn: Strimzi为在Kubernetes上运行Apache Kafka提供了容器镜像和Operator。虽然Strimzi针对Kubernetes进行了优化，但这些镜像在经典的容器环境中也能完美运行。Strimzi容器镜像在JVM上运行 "真实的 "Kafka broker，其启动速度较慢。

source: Subpath permissions always win against the root path permissions as explained above in the `deny1` versus `permit1` permission example. Here is another example showing a subpath permission allowing a public resource access with the root path permission requiring the authorization:
zh_cn: 子路径权限总是赢过根路径权限，正如上面 `deny1` 与 `permit1` 权限的例子所解释的那样。下面是另一个例子，显示了子路径权限允许公共资源访问，而根路径权限需要授权：

source: Subscribe to the <a href="{{site.baseurl}}/newsletter">monthly newsletter</a> to have choice Quarkus content from across our community delivered to your inbox.
zh_cn: 订阅<a href="{{site.baseurl}}/newsletter">每月通讯</a>，将来自我们整个社区的Quarkus精选内容发送到您的收件箱。

source: Success! We now have:
zh_cn: 成功了!我们现在有：

source: Such a callback implementation has to be registered as a "service provider" as defined by `java.util.ServiceLoader`.
zh_cn: 这种回调实现必须作为java "服务提供者(service provider) "注册，从而被 `java.util.ServiceLoader` 来加载。

source: Such a multi-stage build can be achieved as follows:
zh_cn: 这样的多阶段构建可以通过以下方式实现：

source: Supersonic Subatomic Java
zh_cn: 超音速 亚原子 Java

source: Support is provided for JAX-RS Resource Methods
zh_cn: 为JAX-RS Resource方法提供支持

source: Support is provided for REST Client interface methods
zh_cn: 为REST客户端接口方法提供支持

source: Support is provided for Reactive messaging methods
zh_cn: 提供对响应式信息传递方法的支持

source: Support is provided for scheduler methods
zh_cn: 为调度器方法提供支持

source: Support is provided for the declarative annotation-based API
zh_cn: 对基于声明性注解的API提供支持

source: Supported Injection Scopes
zh_cn: 支持的注射范围

source: Supported Public Key Formats
zh_cn: 支持的公钥格式

source: Supported Versions
zh_cn: 受支持版本

source: Supporting native compilation in C
zh_cn: 支持在C语言中进行原生编译

source: Supporting native in a Quarkus extension
zh_cn: 在Quarkus扩展中支持原生

source: Supporting native in a Quarkus extension is even easier as Quarkus provides a lot of tools to simplify all this.
zh_cn: 在Quarkus扩展中支持本机更容易，因为Quarkus提供了很多工具来简化这一切。

source: Supporting native in your application
zh_cn: 在你的应用程序中支持原生

source: Switch back to a `Uni<Void>`.
zh_cn: 切换并返回 `Uni<Void>` 。

source: Switch the incoming channel `orders` (expecting messages from Kafka) to in-memory.
zh_cn: 将传入 channel `orders` (等待来自Kafka的消息)切换到内存中。

source: Switch the outgoing channel `beverages` (writing messages to Kafka) to in-memory.
zh_cn: 将出站 channel `beverages`(向Kafka写消息)切换到内存中。

source: Switch the working directory to `/work`, which we have mounted in <1>.
zh_cn: 将工作目录切换到 `/work` ，我们已经在<1>中挂载了这个目录。

source: Tag the image using your ECR registry information
zh_cn: 使用你的ECR注册信息给镜像打上标签

source: Take the code from the following listing and place into `security-jwt-quickstart/src/test/java/org/acme/security/jwt/GenerateToken.java`:
zh_cn: 从以下列表中拷贝代码，并将其放入 `security-jwt-quickstart/src/test/java/org/acme/security/jwt/GenerateToken.java` ：

source: Templating with Qute
zh_cn: 用Qute进行模板设计

source: Test resources are global, even if they are defined on a test class or custom profile, which means they will all be activated for all tests, even though we do remove duplicates. If you want to only enable a test resource on a single test class or test profile, you can use `@QuarkusTestResource(restrictToAnnotatedClass = true)`.
zh_cn: 测试资源是全局性的，即使它们被定义在一个测试类或自定义profile上，这意味着它们将全部被激活从而用于所有的测试，尽管我们删除了重复的测试。如果您只想针对一个测试类或测试profile启用某一个测试资源，您可以使用 `@QuarkusTestResource(restrictToAnnotatedClass = true)` 。

source: Test the security of your Quarkus applications.
zh_cn: 测试你的Quarkus应用程序的安全性。

source: TestSecurity annotation
zh_cn: TestSecurity 注解

source: Testing
zh_cn: 测试

source: Testing Dev Services
zh_cn: 测试开发服务

source: Testing Different Profiles
zh_cn: 测试不同的Profiles

source: Testing Security
zh_cn: 测试安全性

source: Testing Your Application
zh_cn: 测试您的应用程序

source: Testing a Kafka application
zh_cn: 测试一个Kafka应用程序

source: Testing a reactive application is similar to testing a non-reactive one: use the HTTP endpoint and verify the HTTP responses. The fact that the application is reactive does not change anything.
zh_cn: 测试响应式应用程序与测试非响应式应用程序类似：使用HTTP端点并验证HTTP响应。应用程序是响应式的这一事实并没有改变任何事情。

source: Testing a specific endpoint
zh_cn: 测试特定的节点

source: Testing an existing native executable
zh_cn: 测试一个现有的原生可执行文件

source: Testing and Running
zh_cn: 测试和运行

source: Testing helpers
zh_cn: 测试助手

source: Testing in JVM mode
zh_cn: 在JVM模式下测试

source: Testing in native mode
zh_cn: 在本地模式下测试

source: Testing the Application
zh_cn: 测试应用程序

source: Testing the native executable
zh_cn: 测试原生可执行文件

source: Testing using a Kafka broker
zh_cn: 使用Kafka broker的测试

source: Testing with the SAM CLI
zh_cn: 使用SAM CLI进行测试

source: Testing without a broker
zh_cn: 无broker的测试

source: Testing your `quarkus-oidc` `service` application with `OidcWiremockTestResource` provides the best coverage as even the communication channel is tested against the Wiremock HTTP stubs. `OidcWiremockTestResource` will be enhanced going forward to support more complex Bearer token test scenarios.
zh_cn: 用 `OidcWiremockTestResource` 测试你的 `quarkus-oidc` `service` 应用程序，可以提供最好的覆盖率，因为即使是通信通道也是针对Wiremock HTTP存根(stubs) 进行测试的。 `OidcWiremockTestResource` 将在未来得到加强，以支持更复杂的不记名令牌测试场景。

source: Tests and Transactions
zh_cn: 测试与事务

source: Thanks goes to these wonderful people:
zh_cn: 感谢这些优秀的人：

source: Thanks to the <a href="https://quarkus.io/version/main/guides/mutiny-primer">Mutiny Reactive API</a> , you can compose asynchronous operations and complete the result when everything is done without blocking the I/O threads. This greatly improves resource consumption and elasticity. Most Quarkus APIs are available in both imperative and reactive. As example, you can use the reactive version of the REST Client:
zh_cn: 运用<a href="https://quarkus.io/version/main/guides/mutiny-primer">Mutiny 响应式API</a>，你可以组成异步操作，并在不阻塞I/O线程的情况下达成一切结果。这大大改善了资源消耗和弹性。大多数Quarkus API都可以使用指令式和响应式两种方式。例如，你可以使用REST客户端的响应式版本。

source: Thanks to their stellar startup time and low memory usage, you can implement functions using Quarkus to be used in serverless environments. Quarkus provides Funqy, an approach to writing functions that are deployable to various FaaS environments like AWS Lambda, Azure Functions, Knative, and Knative Events (Cloud Events). It is also usable as a standalone service.
zh_cn: 由于其出色的启动时间和较低的内存使用，您可以使用Quarkus实现在无服务器环境中使用的功能。Quarkus提供了Funqy，一种编写可部署到各种FaaS环境中的函数的方法，如AWS Lambda、Azure函数、Knative和Knative事件(云事件)。它也可以作为一个独立的服务使用。

source: That's all there is to it: with Panache, Hibernate ORM has never looked so trim and neat.
zh_cn: 以上就是它的全部内容：有了Panache，Hibernate ORM看起来变得如此轻量和整洁。

source: That's all there is to it: with Panache, Hibernate Reactive has never looked so trim and neat.
zh_cn: 以上就是它的全部内容：有了Panache，Hibernate Reactive看起来变得如此轻量和整洁。

source: That's all there is to it: with Panache, MongoDB has never looked so trim and neat.
zh_cn: 这就是它的全部内容：有了Panache，MongoDB看起来从未如此简洁

source: The <a href="https://groups.google.com/d/forum/quarkus-dev" target="_blank">quarkus-dev Google Groups</a>
zh_cn: 可以访问 <a href="https://groups.google.com/d/forum/quarkus-dev" target="_blank">quarkus-dev Google Groups</a>讨论组。

source: The <code>@Incoming</code> and <code>@Outgoing</code> annotations are part of <a href="https://www.smallrye.io/smallrye-reactive-messaging">Reactive Messaging</a>. They are used to express from which <em>channel</em> you are consuming and to which <em>channel</em> you are sending. Thanks to Reactive Messaging you can consume and send messages from and to different brokers and transports such as HTTP, Kafka, or <a href="http://camel.apache.org">Apache Camel</a>.
zh_cn: <code>@Incoming</code> 和 <code>@Outgoing</code> 注解是<a href="https://www.smallrye.io/smallrye-reactive-messaging">响应式消息</a>的一部分。它们用于表达您从哪个<em>channel</em>消费，以及向哪个<em>channel</em>发送。由于响应式消息传递，您可以从不同的代理和传输工具（如HTTP、Kafka或<a href="http://camel.apache.org">Apache Camel</a>）消费和发送消息。

source: The AMQP address. If not set, the channel name is used Type: _string_
zh_cn: AMQP地址。如果没有设置，则使用通道名称 类型: _string_

source: The AMQP connector allows Quarkus applications to send and receive messages using the AMQP 1.0 protocol. More details about the protocol can be found in http://docs.oasis-open.org/amqp/core/v1.0/os/amqp-core-overview-v1.0-os.html[the AMQP 1.0 specification]. It's important to note that AMQP 1.0 and AMQP 0.9.1 (implemented by RabbitMQ) are incompatible. Check <<using-rabbitmq,Using RabbitMQ>> to get more details.
zh_cn: AMQP连接器允许Quarkus应用程序使用AMQP 1.0协议来发送和接收消息。关于该协议的更多详情可以在 link:http://docs.oasis-open.org/amqp/core/v1.0/os/amqp-core-overview-v1.0-os.html[AMQP 1.0规范] 中找到。值得注意的是，AMQP 1.0 和 AMQP 0.9.1（由 RabbitMQ 实现）是不兼容的。请查看 link:#using-rabbitmq[使用 RabbitMQ] 以了解更多详情。

source: The AMQP connector connects to AMQP 1.0 brokers such as Apache ActiveMQ or Artemis. To configure the location and credentials of the broker, add the following properties in the `application.properties`:
zh_cn: AMQP连接器连接到AMQP 1.0代理，如Apache ActiveMQ或Artemis。要配置代理的位置和凭证，请在 `application.properties` 中添加以下属性：

source: The AMQP connector supports https://cloudevents.io/[Cloud Events]. The connector sends the outbound record as Cloud Events if:
zh_cn: AMQP连接器支持 link:https://cloudevents.io/[云事件] 。连接器会将出站记录作为云事件发送，如果：

source: The AMQP connector supports https://cloudevents.io/[Cloud Events]. When the connector detects a _structured_ or _binary_ Cloud Events, it adds a `IncomingCloudEventMetadata<T>` into the metadata of the `Message`. `IncomingCloudEventMetadata` contains accessors to the mandatory and optional Cloud Event attributes.
zh_cn: AMQP连接器支持 link:https://cloudevents.io/[云事件] 。当连接器检测到一个 _structured_ 或 _binary_ 云事件时，它会向 `Message` 的元数据中添加一个 `IncomingCloudEventMetadata<T>` 。 `IncomingCloudEventMetadata` 包含对强制和可选云事件属性的访问器。

source: The AMQP container id Type: _string_
zh_cn: AMQP容器的id 类型: _string_

source: The AWS SAM CLI allows you to run your lambda's locally on your laptop in a simulated Lambda environment. This requires Docker to be installed. After you have built your Maven project, execute this command:
zh_cn: AWS SAM CLI允许你在模拟的Lambda环境中的笔记本电脑上，本地运行你的lambda。这需要安装Docker。在构建了Maven项目后，执行这个命令：

source: The Batch API and Runtime will be available out of the box. Please refer to the <a href="#">Batch documentation</a>, or the <a href="#">JBeret documentation</a> to learn about Batch Applications.
zh_cn: 批处理API和运行时将是开箱即用的。请参考<a href="">批处理文档</a>，或<a href="">JBeret文档</a>以了解批处理应用程序。

source: The Batch API requires the @BatchProperty annotation to inject the specific configuration from the batch definition file. Instead, you can use the @ConfigProperty annotation, which is used to inject configuration properties in Quarkus using the MicroProfile Config API and keep consistency:
zh_cn: 批处理API需要@BatchProperty注解来注入批处理定义文件中的特定配置。或者，你可以使用@ConfigProperty注解，它被用来在Quarkus中使用MicroProfile配置API注入配置属性，并保持一致性：

source: The Batch APIs JobOperator and JobRepository are available as CDI beans, so they can be injected directly into any code:
zh_cn: 批处理API的JobOperator和JobRepository可以作为CDI Bean使用，所以它们可以直接注入到任何代码中：

source: The CDI name of the handler class must match the value specified within the `quarkus.lambda.handler` property.
zh_cn: 处理程序类的CDI名称必须与 `quarkus.lambda.handler` 属性中指定的值匹配。

source: The Cloud Event mode (`structured` or `binary` (default)). Indicates how are written the cloud events in the outgoing record Type: _string_
zh_cn: 云事件模式（ `structured` 或 `binary` （默认））。表示如何在传出的记录中写入云事件 类型: _string_

source: The Event Hub connection string given by Azure.
zh_cn: 由Azure提供的Event Hub连接字符串。

source: The HTML page
zh_cn: HTML页面

source: The HTTP method receives the payload and returns a `CompletionStage` completed when the message is written to Kafka
zh_cn: HTTP方法接会接收payload，并在消息被写入Kafka时返回一个 `CompletionStage`

source: The HTTP method receiving the payload returns a `Uni<Void>`. The HTTP response is written when the operation completes (the entity is persisted and written to Kafka).
zh_cn: 接收payload的HTTP方法返回一个 `Uni<Void>` 。当操作完成后，会返回HTTP响应(实体被持久化并被写入Kafka)。

source: The JBeret Quarkus extension supports the following configuration:
zh_cn: JBeret Quarkus扩展支持以下配置：

source: The JBeret REST API, provides REST resources to several operations around the Batch API: starting and stopping jobs, querying the status of a job, schedule a job, and many more. The extension includes a REST client to simplify the REST API calls:
zh_cn: JBeret REST API，为围绕Batch API的几个操作提供REST资源：启动和停止作业、查询作业状态、安排作业等等。该扩展包括一个REST客户端来简化REST API的调用：

source: The JBeret REST is integrated as separate extension that can be easily added to the target project with the following dependency:
zh_cn: JBeret REST被集成为独立的扩展，可以通过以下依赖关系轻松地添加到目标项目中：

source: The JBeret Scheduler is integrated out of the box in this extension.
zh_cn: 在这个扩展中，JBeret Scheduler是开箱即用的。

source: The JPA `IdentityProvider` creates a `SecurityIdentity` instance, which is used during user authentication to verify and authorize access requests making your Quarkus application secure.
zh_cn: JPA `IdentityProvider` 创建了一个 `SecurityIdentity` 实例，在用户认证过程中，它被用来验证和授权访问请求以保证您的Quarkus应用程序安全。

source: The JWT string is the Base64 URL encoded string that has 3 parts separated by '.' characters. First part - JWT headers, second part - JWT claims, third part - JWT signature.
zh_cn: JWT字符串是Base64 URL编码的字符串，有3个部分，由'.'字符分隔。第一部分 - JWT头，第二部分 - JWT要求，第三部分 - JWT签名。

source: The JobScheduler does not support persistent schedules.
zh_cn: JobScheduler不支持持久化调度。

source: The Kafka connector disables the Kafka auto commit when it is not explicitly enabled. This behavior differs from the traditional Kafka consumer. If high throughput is important for you, and you are not limited by the downstream, we recommend to either:
zh_cn: 当Kafka connector没有明确启用时，它将禁用Kafka自动提交。这与传统的Kafka消费者不同。如果高吞吐量对您来说很重要而且您不受下游的限制，我们建议要么：

source: The Kafka connector supports three strategies:
zh_cn: Kafka connector支持三种策略：

source: The Kafka outbound connector handles back-pressure, monitoring the number of in-flight messages waiting to be written to the Kafka broker. The number of in-flight messages is configured using the `max-inflight-messages` attribute and defaults to 1024.
zh_cn: Kafka的出站connector负责处理背压，并且会监测等待写入Kafka broker中的in-flight的消息数量。in-flight的消息的数量是通过 `max-inflight-messages` 配置的，默认为1024。

source: The Kotlin plugin is activated, which implicitly adds `sourceDirectory` and `testSourceDirectory` build properties to point to Kotlin sources (`src/main/kotlin` and `src/test/kotlin` respectively)
zh_cn: Kotlin插件被激活，它隐含地添加了 `sourceDirectory` 和 `testSourceDirectory` 构建属性，以指向Kotlin代码(分别是 `src/main/kotlin` 和 `src/test/kotlin` )

source: The Kotlin plugin version needs to be specified.
zh_cn: 需要指定Kotlin插件的版本。

source: The MP Metrics API compatibility layer will be moved to a different extension in the future.
zh_cn: MP Metrics API 的兼容层会在将来迁移至另外的扩展中。

source: The MicroProfile Config specification defines configuration keys as an arbitrary `.`-delimited string. However, structured formats like YAML only support a subset of the possible configuration namespace. For example, consider the two configuration properties `quarkus.http.cors` and `quarkus.http.cors.methods`. One property is the prefix of another, so it may not be immediately evident how to specify both keys in your YAML configuration.
zh_cn: MicroProfile Config 规范将配置键定义为任意的 `.` - 分隔字符串。然而，像 YAML 这样的结构化格式可能只支持配置命名空间的一个子集。例如，考虑有两个配置属性 `quarkus.http.cors` 和 `quarkus.http.cors.methods` 的情况。一个属性是另一个属性的前缀，因此如何在 YAML 配置中指定这两个键可能不是很明确。

source: The Micrometer extension automatically times HTTP server requests. Following Prometheus naming conventions for timers, look for `http_server_requests_seconds_count`, `http_server_requests_seconds_sum`, and `http_server_requests_seconds_max`. Dimensional labels have been added for the requested uri, the HTTP method (GET, POST, etc.), the status code (200, 302, 404, etc.), and a more general outcome field.
zh_cn: Micrometer扩展会自动为HTTP服务器请求计时。按照Prometheus对timers的命名惯例，查找 `http_server_requests_seconds_count` , `http_server_requests_seconds_sum` , 和 `http_server_requests_seconds_max` 。维度标签已经被添加到请求的URI、HTTP方法（GET、POST等）、状态代码（200、302、404等）和一个更通用的结果字段。

source: The Microsoft Native Tools for Visual Studio must first be initialized before packaging. You can do this by starting the `x64 Native Tools Command Prompt` that was installed with the Visual Studio Build Tools. At `x64 Native Tools Command Prompt` you can navigate to your project folder and run `mvnw package -Pnative`.
zh_cn: 在打包之前，必须首先初始化 Microsoft Native Tools for Visual Studio。你可以通过启动与Visual Studio Build Tools 一起安装的 `x64 Native Tools Command Prompt` 来做到这一点。在 `x64 Native Tools Command Prompt` ，你可以导航到你的项目文件夹并运行 `mvnw package -Pnative` 。

source: The MongoDB reactive client uses Mutiny reactive types. If you are not familiar with Mutiny, check xref:mutiny-primer.adoc[Mutiny - an intuitive reactive programming library].
zh_cn: MongoDB的响应式客户端使用Mutiny响应式类型。如果你不熟悉Mutiny，请查看 link:mutiny-primer.html[Mutiny - 一个直观的响应式编程库] 。

source: The NVD CPE team updates the list regularly, but if you encounter a false positive, report the details by creating an issue in the link:https://github.com/quarkusio/quarkus/issues/2611[quarkusio] repository.
zh_cn: NVD CPE团队会定期更新列表，但如果您遇到一个异常，请在 link:https://github.com/quarkusio/quarkus/issues/2611[quarkusio] 仓库中创建一个issue来报告细节。

source: The OpenID Connect extension allows you to define the adapter configuration using the `application.properties` file which should be located at the `src/main/resources` directory.
zh_cn: OpenID Connect扩展允许您使用 `application.properties` 来定义适配器配置，该文件应位于 `src/main/resources` 目录下。

source: The OpenTelemetry extension will use by default a random https://github.com/open-telemetry/opentelemetry-specification/blob/main/specification/trace/sdk.md#id-generators[ID Generator] when creating the trace and span identifier.
zh_cn: OpenTelemetry扩展将默认使用一个随机的 link:https://github.com/open-telemetry/opentelemetry-specification/blob/main/specification/trace/sdk.md#id-generators[ID发生器] 来创建trace和span标识符。

source: The POJO Codec
zh_cn: POJO编解码器

source: The POJO Codec have enhanced generic support via `PropertyCodecProvider`, Quarkus will automatically register any `PropertyCodecProvider` with the POJO Codec (these classes are automatically made CDI beans of `@Singleton` scope). When building native executables and using generic types, you might need to register the type arguments for reflection.
zh_cn: POJO Codec通过 `PropertyCodecProvider` 增强了对泛型的支持，Quarkus会自动在POJO Codec中注册任何 `PropertyCodecProvider` （这些类会自动成为 `@Singleton` 范围的CDI bean）。当构建本地可执行文件和使用用泛型类型时，你可能需要用反射来注册类型参数。

source: The PojoCodecProvider: easy object to BSON document conversion.
zh_cn: PojoCodecProvider：简单的object（对象）到 BSON 文档的转换。

source: The Quarkus JBeret Extension adds support for JSR-352 Batch Applications for the Java Platform. JBeret is an implementation of the JSR-352.
zh_cn: Quarkus JBeret Extension增加了对Java平台的JSR-352批处理应用的支持。JBeret是JSR-352的一个实现。

source: The Quarkus Micro Image is a small container image providing the right set of dependencies to run your native application. It is based on https://catalog.redhat.com/software/containers/ubi8-micro/601a84aadd19c7786c47c8ea?container-tabs=overview[UBI Micro]. This base image has been tailored to work perfectly in containers.
zh_cn: Quarkus 微镜像是一个小型的容器镜像，为运行你的原生应用程序提供了正确的依赖性集合。它是基于 https://catalog.redhat.com/software/containers/ubi8-micro/601a84aadd19c7786c47c8ea?container-tabs=overview[UBI Micro] 的。这个基础镜像已经被定制为在容器中完美运行。

source: The Quarkus `quarkus-oidc` extension provides a reactive, interoperable, multitenant-enabled OIDC adapter that supports Bearer Token and Authorization Code Flow authentication mechanisms. The Bearer Token mechanism extracts the token from the HTTP Authorization header. The Authorization Code Flow mechanism redirects the user to an OIDC provider to authenticate the identity of the user. After the user is redirected back to Quarkus, the mechanism completes the authentication process by exchanging the provided code that was granted for the ID, access, and refresh tokens.
zh_cn: `quarkus-oidc` 扩展提供了一个响应式的、可互操作的、支持多租户的OIDC适配器，以支持 `Bearer Token` 和 `Authorization Code Flow` 认证机制。`Bearer Token` 机制从HTTP header中提取token。 `Authorization Code Flow` 机制将用户重定向到OIDC提供者来认证用户身份，并在用户被重定向回Quarkus后，通过将提供的代码授权与ID、访问和刷新token进行交换来完成认证过程。

source: The Quarkus community publishes thoughtful how-to videos to help you get started. Check them out on <a href="https://www.youtube.com/playlist?list=PLsM3ZE5tGAVbMz1LJqc8L5LpnfxPPKloO">YouTube</a>.
zh_cn: Quarkus社区发布了周到的操作视频，以帮助您开始使用。请在<a href="https://www.youtube.com/playlist?list=PLsM3ZE5tGAVbMz1LJqc8L5LpnfxPPKloO">YouTube</a>上查看它们。

source: The Quarkus team and community take all security bugs very seriously. You can find our guidelines here regarding our policy and security disclosure.
zh_cn: Quarkus团队和社区非常重视所有的安全漏洞。你可以在这里找到关于我们的政策和安全披露的指导方针。

source: The Quote object
zh_cn: Quote对象

source: The Reactive Messaging AMQP connector
zh_cn: 响应式消息AMQP连接器

source: The Redis extension allows you to configure multiple clients. Using several clients works the same way as having a single client.
zh_cn: Redis扩展允许你配置多个客户端。使用多个客户端与使用一个客户端的方式相同。
